In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import math
import numpy as np
from numpy.random import randn 
np.random.seed(10)

In [2]:
labels = ["a", "b", "c"]
arr = [10, 20, 30]

In [3]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [4]:
a = pd.Series([1, 3, 7, 9], ["Computer", "Monitor", "Mouse", "Keyboard"])

In [5]:
b = pd.Series([5, 6, 9, 10], ["Computer", "Monitor", "Mouse", "Hard Disk"])

In [6]:
a+b

Computer      6.0
Hard Disk     NaN
Keyboard      NaN
Monitor       9.0
Mouse        16.0
dtype: float64

In [7]:
a[1:3]

Monitor    3
Mouse      7
dtype: int64

In [8]:
a["Computer":"Mouse"]

Computer    1
Monitor     3
Mouse       7
dtype: int64

In [9]:
df = pd.DataFrame(randn(5,4), index="A B C D E".split(), columns="W X Y Z".split())

In [10]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [11]:
df["W"]

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [12]:
df["W"] + df["X"]

A    2.046865
B   -0.098750
C   -0.170309
D    0.063208
E   -1.001465
dtype: float64

In [13]:
df[["W", "X"]]

          W         X
A  1.331587  0.715279
B  0.621336 -0.720086
C  0.004291 -0.174600
D -0.965066  1.028274
E -1.136602  0.135137

In [14]:
df.W

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [15]:
df["new"] = [3, 7, 9, 10, 12]

In [16]:
df

          W         X         Y         Z  new
A  1.331587  0.715279 -1.545400 -0.008384    3
B  0.621336 -0.720086  0.265512  0.108549    7
C  0.004291 -0.174600  0.433026  1.203037    9
D -0.965066  1.028274  0.228630  0.445138   10
E -1.136602  0.135137  1.484537 -1.079805   12

In [17]:
df["total"] = df["X"] + df["Z"]

In [18]:
df["W total X Y Z new".split()]

          W     total         X         Y         Z  new
A  1.331587  0.706895  0.715279 -1.545400 -0.008384    3
B  0.621336 -0.611537 -0.720086  0.265512  0.108549    7
C  0.004291  1.028437 -0.174600  0.433026  1.203037    9
D -0.965066  1.473412  1.028274  0.228630  0.445138   10
E -1.136602 -0.944668  0.135137  1.484537 -1.079805   12

In [19]:
df.drop("new", axis=1)

          W         X         Y         Z     total
A  1.331587  0.715279 -1.545400 -0.008384  0.706895
B  0.621336 -0.720086  0.265512  0.108549 -0.611537
C  0.004291 -0.174600  0.433026  1.203037  1.028437
D -0.965066  1.028274  0.228630  0.445138  1.473412
E -1.136602  0.135137  1.484537 -1.079805 -0.944668

In [20]:
df

          W         X         Y         Z  new     total
A  1.331587  0.715279 -1.545400 -0.008384    3  0.706895
B  0.621336 -0.720086  0.265512  0.108549    7 -0.611537
C  0.004291 -0.174600  0.433026  1.203037    9  1.028437
D -0.965066  1.028274  0.228630  0.445138   10  1.473412
E -1.136602  0.135137  1.484537 -1.079805   12 -0.944668

In [21]:
df.drop("new Z".split(), axis=1, inplace=True)

In [22]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  0.621336 -0.720086  0.265512 -0.611537
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668

In [23]:
df.drop("E", inplace=True)
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  0.621336 -0.720086  0.265512 -0.611537
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412

In [24]:
df.loc["C"]

W        0.004291
X       -0.174600
Y        0.433026
total    1.028437
Name: C, dtype: float64

In [25]:
df.iloc[2]

W        0.004291
X       -0.174600
Y        0.433026
total    1.028437
Name: C, dtype: float64

In [26]:
df.loc[["B", "D"],["X", "Y"]]

          X         Y
B -0.720086  0.265512
D  1.028274  0.228630

In [30]:
df.iloc[1:3,2:5]

          Y     total
B  0.265512 -0.611537
C  0.433026  1.028437

In [31]:
df > 0

       W      X      Y  total
A   True   True  False   True
B   True  False   True  False
C   True  False   True   True
D  False   True   True   True

In [32]:
df[df>0]

          W         X         Y     total
A  1.331587  0.715279       NaN  0.706895
B  0.621336       NaN  0.265512       NaN
C  0.004291       NaN  0.433026  1.028437
D       NaN  1.028274  0.228630  1.473412

In [33]:
df[df<=0] = 0

In [34]:
df

          W         X         Y     total
A  1.331587  0.715279  0.000000  0.706895
B  0.621336  0.000000  0.265512  0.000000
C  0.004291  0.000000  0.433026  1.028437
D  0.000000  1.028274  0.228630  1.473412

In [35]:
df.loc["F"] = [1, 2, 3, 4]

In [36]:
df

          W         X         Y     total
A  1.331587  0.715279  0.000000  0.706895
B  0.621336  0.000000  0.265512  0.000000
C  0.004291  0.000000  0.433026  1.028437
D  0.000000  1.028274  0.228630  1.473412
F  1.000000  2.000000  3.000000  4.000000

In [37]:
df.loc["Z"] = [1, 2, 3, 4]

In [38]:
df.loc["Y"] = [1, 2, 3, 4]

In [39]:
df

          W         X         Y     total
A  1.331587  0.715279  0.000000  0.706895
B  0.621336  0.000000  0.265512  0.000000
C  0.004291  0.000000  0.433026  1.028437
D  0.000000  1.028274  0.228630  1.473412
F  1.000000  2.000000  3.000000  4.000000
Z  1.000000  2.000000  3.000000  4.000000
Y  1.000000  2.000000  3.000000  4.000000

In [46]:
df.append(pd.DataFrame([[2, 3, 4, 5]], columns="W X Y total".split()))

          W         X         Y     total
A  1.331587  0.715279  0.000000  0.706895
B  0.621336  0.000000  0.265512  0.000000
C  0.004291  0.000000  0.433026  1.028437
D  0.000000  1.028274  0.228630  1.473412
F  1.000000  2.000000  3.000000  4.000000
Z  1.000000  2.000000  3.000000  4.000000
Y  1.000000  2.000000  3.000000  4.000000
0  2.000000  3.000000  4.000000  5.000000

In [47]:
df["W"] > 0

A     True
B     True
C     True
D    False
F     True
Z     True
Y     True
Name: W, dtype: bool

In [48]:
(df["W"] > 0) & (df["X"] > 0)

A     True
B    False
C    False
D    False
F     True
Z     True
Y     True
dtype: bool

In [49]:
(df["W"] > 0) | (df["X"] > 0)

A    True
B    True
C    True
D    True
F    True
Z    True
Y    True
dtype: bool

In [50]:
df[(df["W"] > 0) & (df["X"] > 0)]

          W         X    Y     total
A  1.331587  0.715279  0.0  0.706895
F  1.000000  2.000000  3.0  4.000000
Z  1.000000  2.000000  3.0  4.000000
Y  1.000000  2.000000  3.0  4.000000

In [53]:
df[(df["W"] > 0) & (df["X"] > 0)].iloc[0:2]

          W         X    Y     total
A  1.331587  0.715279  0.0  0.706895
F  1.000000  2.000000  3.0  4.000000

In [54]:
df[(df["W"] > 0) & (df["X"] > 0)].iloc[0:2]

          W         X    Y     total
A  1.331587  0.715279  0.0  0.706895
F  1.000000  2.000000  3.0  4.000000

In [59]:
df.reset_index(inplace=True)

In [65]:
df.index = list(df["index"])

In [66]:
df

  index         W         X         Y     total
A     A  1.331587  0.715279  0.000000  0.706895
B     B  0.621336  0.000000  0.265512  0.000000
C     C  0.004291  0.000000  0.433026  1.028437
D     D  0.000000  1.028274  0.228630  1.473412
F     F  1.000000  2.000000  3.000000  4.000000
Z     Z  1.000000  2.000000  3.000000  4.000000
Y     Y  1.000000  2.000000  3.000000  4.000000